In [4]:
import pandas as pd
import pymysql
from sqlalchemy import create_engine

from sqlalchemy import text

In [5]:
import getpass
password = getpass.getpass()

In [6]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)

How many distinct (different) actors' last names are there?

In [7]:
query = '''SELECT count(distinct(last_name)) as different_names from actor;'''
pd.read_sql_query(query, engine)

   different_names
0              121

Add an additional column day_type with values 'weekend' and 'workday' depending on the rental day of the week.

In [8]:
query = '''SELECT rental_date,
    dayname(rental_date) as "weekday",
    case 
        when dayname(rental_date) in ('Saturday', 'Sunday') then 'weekend'
        else 'workday'
    end as "day_type"
from rental'''
pd.read_sql_query(query, engine)

              rental_date  weekday day_type
0     2005-05-24 22:53:30  Tuesday  workday
1     2005-05-24 22:54:33  Tuesday  workday
2     2005-05-24 23:03:39  Tuesday  workday
3     2005-05-24 23:04:41  Tuesday  workday
4     2005-05-24 23:05:21  Tuesday  workday
...                   ...      ...      ...
16039 2006-02-14 15:16:03  Tuesday  workday
16040 2006-02-14 15:16:03  Tuesday  workday
16041 2006-02-14 15:16:03  Tuesday  workday
16042 2006-02-14 15:16:03  Tuesday  workday
16043 2006-02-14 15:16:03  Tuesday  workday

[16044 rows x 3 columns]

Get all films with ARMAGEDDON in the title.

In [26]:

query = "SELECT * from film where title like '%%ARMAGEDDON%%';"
pd.read_sql_query(query, engine)

# Needed to add %% to the end of the query to get the correct result

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,39,ARMAGEDDON LOST,A Fast-Paced Tale of a Boat And a Teacher who ...,2006,1,None,5,0.99,99,10.99,G,Trailers,2006-02-15 05:03:42
1,507,LADYBUGS ARMAGEDDON,A Fateful Reflection of a Dog And a Mad Scient...,2006,1,None,4,0.99,113,13.99,NC-17,Deleted Scenes,2006-02-15 05:03:42
2,571,METAL ARMAGEDDON,A Thrilling Display of a Lumberjack And a Croc...,2006,1,None,6,2.99,161,26.99,PG-13,"Trailers,Commentaries,Deleted Scenes",2006-02-15 05:03:42
3,598,MOSQUITO ARMAGEDDON,A Thoughtful Character Study of a Waitress And...,2006,1,None,6,0.99,57,22.99,G,Trailers,2006-02-15 05:03:42
4,838,STAGECOACH ARMAGEDDON,A Touching Display of a Pioneer And a Butler w...,2006,1,None,5,4.99,112,25.99,R,"Trailers,Deleted Scenes",2006-02-15 05:03:42
5,844,STEERS ARMAGEDDON,A Stunning Character Study of a Car And a Girl...,2006,1,None,6,4.99,140,16.99,PG,"Trailers,Commentaries,Deleted Scenes,Behind th...",2006-02-15 05:03:42

Get 10 the longest films.

In [16]:
query = '''SELECT title, length from film order by length desc limit 10;'''
pd.read_sql_query(query, engine)

                title  length
0      DARN FORRESTER     185
1        POND SEATTLE     185
2       CHICAGO NORTH     185
3       MUSCLE BRIGHT     185
4        WORST BANGER     185
5         GANGS PRIDE     185
6  SOLDIERS EVOLUTION     185
7           HOME PITY     185
8   SWEET BROTHERHOOD     185
9      CONTROL ANTHEM     185

How many films include Behind the Scenes content?

In [22]:
query = '''select count(*) from film where special_features = "Behind the Scenes";'''
# this shuoild be the correct query but doesn't work in python?

In [25]:
query = '''SELECT count(*) from film where special_features like '%%Behind the Scenes%%';'''
pd.read_sql_query(query, engine)

   count(*)
0       538

Which kind of movies (rating) have a mean duration of more than two hours?

In [23]:
query = '''SELECT rating, round(AVG(length))>=120 as average_duration 
from film 
group by rating
order BY average_duration DESC; '''
pd.read_sql_query(query, engine)

  rating  average_duration
0  PG-13                 1
1     PG                 0
2      G                 0
3  NC-17                 0
4      R                 0

Rank films by length (filter out the rows that have nulls or 0s in length column). In your output, only select the columns title, length, and the rank.

In [30]:
query = '''SELECT title, length, rank() over (order by length desc) as 'rank' 
from film
where length is not null and length > 0;'''
pd.read_sql_query(query, engine)

                   title  length  rank
0          CHICAGO NORTH     185     1
1         CONTROL ANTHEM     185     1
2         DARN FORRESTER     185     1
3            GANGS PRIDE     185     1
4              HOME PITY     185     1
..                   ...     ...   ...
995         ALIEN CENTER      46   996
996            IRON MOON      46   996
997        KWAI HOMEWARD      46   996
998     LABYRINTH LEAGUE      46   996
999  RIDGEMONT SUBMARINE      46   996

[1000 rows x 3 columns]